<html>
<head>
<title>Nuno D. Mendes</title>
</head>
<body bgcolor="#FFFFFF">

<h1 align="center"><a href="../index.html">Nuno D. Mendes</a></h1>

<p align="center">
<a href="../research.html">Research interests</a> |
<a href="../publications.html">Publications</a> |
<a href="../software.html">Software</a> |
<a href="../shortcv.html">Short CV</a> |
<a href="../personal.html">Personal</a> |
<a href="../documents.html">Documents</a>
</p>

<hr>

<h3><p align="center">IUPAC Code Generation</p></h3>

<p align="center">
Nuno D. Mendes and David V. Nunes
<br> Supervised by Ana T. Freitas and Arlindo L. Oliveira
<br>Graduation Thesis, IST, Universidade T&eacute;cnica de Lisboa, 2004
</p>
<p>A grande quantidade de dados dispon&iacute;veis na &aacute;rea da Biologia requer m&eacute;todos de extrac&ccedil;&atilde;o de conhecimento poderosos, sistem&aacute;ticos e eficientes. Em particular, a identifica&ccedil;&atilde;o de sequ&ecirc;ncias de nucle&oacute;tidos, designadas de consensos, onde se ligam factores de transcri&ccedil;&atilde;o respons&aacute;veis, em parte, pelo mecanismo de regula&ccedil;&atilde;o g&eacute;nica &eacute; essencial para uma compreens&atilde;o do papel de cada gene.
</p>
<p>Actualmente, existem v&aacute;rios algoritmos cujo objectivo &eacute; encontrar sequ&ecirc;ncias candidatas a sequ&ecirc;ncias de consenso. Estes algoritmos podem ser divididos em duas classes: m&eacute;todos restritivos e m&eacute;todos prol&iacute;ficos. Os m&eacute;todos restritivos obt&ecirc;m poucas respostas com elevada precis&atilde;o, enquanto que os m&eacute;todos prol&iacute;ficos obt&ecirc;m muitas respostas com baixa precis&atilde;o, exigindo um esfor&ccedil;o de p&oacute;s-processamento.
</p>
<p>Neste trabalho utilizamos o SMILE que &eacute; um m&eacute;todo prol&iacute;fico para a extrac&ccedil;&atilde;o de sequ&ecirc;ncias de consenso na regi&atilde;o promotora dos genes. Face ao n&uacute;mero significativo das respostas obtidas pretende-se, com este trabalho, avaliar poss&iacute;veis solu&ccedil;&otilde;es de p&oacute;s-processamento, de modo a garantir a utilidade de informa&ccedil;&atilde;o extra&iacute;da para os utilizadores do algoritmo. Assim, definiram-se dois grandes objectivos:
</p>
<ul>
<li>A avalia&ccedil;&atilde;o de m&eacute;todos estat&iacute;sticos que permitam aferir da signific&acirc;ncia biol&oacute;gica das respostas obtidas;</li>
<li>A obten&ccedil;&atilde;o de uma descri&ccedil;&atilde;o compacta da informa&ccedil;&atilde;o extra&iacute;da.
</ul>


<p><b>Keywords:</b> Gene, regula&ccedil;&atilde;o g&eacute;nica, regi&atilde;opromotora, sequ&ecirc;ncias degeneradas, IUPAC, avalia&ccedil;&atilde;o estat&iacute;stica de biosequ&ecirc;ncias, SMILE, extrac&ccedil;&atilde;o de motivos 
</p>

<p>
<b>Get a preprint:</b>
<a href="http://algos.inesc-id.pt/~ndm/pub/publications/04-TFC/04-ndm-tfc.pdf">[pdf]</a>
<a href="http://algos.inesc-id.pt/~ndm/pub/publications/04-TFC/04-ndm-tfc.pdf.gz">[pdf.gz]</a>
</p>

<hr>

<p align="center">
<a href="../research.html">Research interests</a> |
<a href="../publications.html">Publications</a> |
<a href="../software.html">Software</a> |
<a href="../shortcv.html">Short CV</a> |
<a href="../personal.html">Personal</a> |
<a href="../documents.html">Documents</a>
</p>

</body> 
</html>
